# FootPrintRoof Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FootPrintRoof Class
Members See Also
---
Represents kinds of FootPrintRoofs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FootPrintRoof : RoofBase
```

Visual Basic
---
```text
Public Class FootPrintRoof _
	Inherits RoofBase
```

Visual C++
---
```text
public ref class FootPrintRoof : public RoofBase
```

# Remarks
The FootPrintRoof object represents some kinds of FootPrintRoof in Revit. The RoofType property is used to distinguish the type of the roof.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..RoofBase Autodesk.Revit.DB..::..FootPrintRoof
# See Also
FootPrintRoof Members
Autodesk.Revit.DB Namespace